cask_args appdir: "~/Applications"

brew "fish"
brew "fisher"
brew "ffmpeg"
brew "git"
brew "gnupg"
brew "helix"
brew "htop"
brew "lazygit"
brew "lua-language-server"
brew "mas"
brew "opam"
brew "pandoc"
brew "pyenv"
brew "qemu"
brew "rage"
brew "ripgrep"
brew "starship"
brew "taplo"
brew "tmux"
brew "yt-dlp"

cask "affinity-designer"
cask "affinity-photo"
cask "alfred"
cask "altserver"
cask "chromium"
cask "dash"
cask "discord"
cask "firefox"
cask "font-iosevka-ss15"
cask "font-sf-pro"
cask "font-tex-gyre-termes"
cask "gpg-suite"
cask "hammerspoon"
cask "hyperkey"
cask "mos", app_dir: "/Applications"
cask "sketch"
cask "swift-shift"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "wezterm"
cask "zotero"

mas "AdGuard for Safari", id: 1440147259
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "System Color Picker", id: 1545870783
