tap "d12frosted/emacs-plus"

cask_args appdir: "~/Applications"

brew "direnv"
brew "emacs-plus@30", args: ["with-xwidgets", "with-imagemagick"]
brew "ffmpeg"
brew "fish"
brew "git"
brew "go"
brew "imagemagick"
brew "mas"
brew "n"
brew "opam"
brew "pandoc"
brew "pyenv"
brew "rage"
brew "stow"
brew "yt-dlp"

cask "affinity-designer"
cask "affinity-photo"
cask "alfred"
cask "altserver"
cask "chromium"
cask "discord"
cask "firefox"
cask "font-iosevka-ss15"
cask "font-sf-pro"
cask "font-tex-gyre-termes"
cask "hammerspoon"
cask "hyperkey"
cask "iterm2"
cask "keka"
cask "mos", app_dir: "/Applications"
cask "sketch"
cask "swift-shift"
cask "transmission"
cask "zotero"

mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "System Color Picker", id: 1545870783
