cask_args appdir: "~/Applications"

brew "ffmpeg"
brew "fzf"
brew "git"
brew "jq"
brew "lazygit"
brew "lima"
brew "mas"
brew "neovim"
brew "opam"
brew "pandoc"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "typewritten"
brew "tmux"
brew "vim"
brew "yt-dlp"

cask "affinity-designer"
cask "affinity-photo"
cask "alfred"
cask "altserver"
brew "bandcamp-dl"
cask "brave-browser"
cask "dash"
cask "discord"
cask "firefox"
cask "font-iosevka-ss15"
cask "font-tex-gyre-termes"
cask "hammerspoon"
cask "iterm2"
cask "monitorcontrol"
cask "mos", args: { appdir: "/Applications" }
cask "sketch"
cask "swift-shift"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "zotero"

mas "AdGuard for Safari", id: 1440147259
mas "Keynote", id: 409183694
mas "System Color Picker", id: 1545870783